Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t
Serialization structure for the Load.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.ModelObject
Base class.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.FatherId
Id of the Father for the Load.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.Spanning
Spanning.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.PrimaryAxisDirection
Vector for the Primary Axis Direction.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.AutomaticPrimaryAxisWeight
Whether to use Automatic Primary Axis Weight or not.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.Weight
Weight.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.LoadDispersionAngle
Load Dispersion Angle.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.CreateFixedSupportConditionsAutomatically
Whether to Create Fixed Support Conditions Automatically or not.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.LoadAttachment
Attach To Member or Don't Attach

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.PartNames
Include or Exclude Parts

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.aPartFilter
Part Filter.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.BoundingBoxDx
Bounding Box X.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.BoundingBoxDy
Bounding Box Y.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.BoundingBoxDz
Bounding Box Z.

Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t.LoadGroupId
Load group attribute for loads